ХМНПФ_Общее/Documents/уп_ЗаявлениеЗЛОНазначенииНЧТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЗаявлениеЗЛОНазначенииНЧТП</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодаетсяПредставителем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаимДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ЗЗЛПрилагаемыеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СерияДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерДокПодтвПолнПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВыдачиДокПодтвПолнПредставителя1</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КемВыданДокПодтвПолнПредставителя2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДопДокСВНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТрудПенсияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СрокПолномочийПредставителя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДопДокНеПозднее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтрахЧастьС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПериодВыплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПроживаетЗаГраницей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Пожизненная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Срочная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗастрахованноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокНаСчете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОстатокДопФинансирование</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>УчитыватьДопВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПринятоеРешение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДопДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НаименованиеДопДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уп_ЗЗЛПрилагаемыеДокументы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>НаимЧасть2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Представлен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ХМНПФ_Общее/AccumulationRegisters/уп_РезервыОПС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_РезервыОПС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаКомпенсации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВосполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СуммаВозмещения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Движение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.уп_ДокументРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДвиженияЕПС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.епс_ВидыДвиженияПенсионныхНакоплений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипСуммы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ТипыСуммОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыРезервовОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ХМНПФ_Общее/InformationRegisters/уп_ЛицевыеСчетаЗастрахованныхЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>уп_ЛицевыеСчетаЗастрахованныхЛиц</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаВыплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ФормыВыплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Банк</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерЛицевогоСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипВыплат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уп_ТипыВыплат</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НеДействует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДоговорОПС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уп_ДоговорыОПС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗастрахованноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ХМНПФ_Общее/Documents/уп_ЗаявлениеЗЛОНазначенииНЧТП/Ext/ObjectModule.bsl
Процедура ХМ_НеТиповыеИзменения() 
	
	// ХМНПФ 26.10.2015 ШадринАВ // Новая ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
	// ХМНПФ 28.10.2015 ШадринАВ // Добавлен реквизит ХМ_ТипРешения // №11
	// ХМНПФ 28.02.2017 Кучеров // Новая Функция ХМ_ПечатьWeb()
	// ХМНПФ 28.02.2017 Кучеров // убрал директиву на клиенте
	// ХМНПФ 30.05.2017 Кучеров // Новая РассчитатьОстатокСумм()	
	// ХМНПФ 30.05.2017 Кучеров // ОбработкаЗаполнения()
	// ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
	// ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьПоМакетуСервер() // №3395    

КонецПроцедуры
	
// +ХМНПФ 26.10.2015 ШадринАВ // ОбработкаЗаполнения() // ОПС_заяв_на_основ_дгвр
&После("ОбработкаЗаполнения")
Процедура ХМ_ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.уп_ДоговорыОПС") Тогда
		Организация = ДанныеЗаполнения.Организация;
		ДоговорОПС = ДанныеЗаполнения.Ссылка;
		ЗастрахованноеЛицо = ДанныеЗаполнения.Участник;
		ФормаВыплаты = Перечисления.уп_ФормыВыплаты.РасчетныйСчет;
		// +ХМНПФ 30.10.2015 ШадринАВ // ОбработкаЗаполнения() // №24
		#Если Клиент Тогда
		Дата = РабочаяДата;
		#ИначеЕсли Сервер Тогда
		Дата = ТекущаяДата();
		#КонецЕсли
		// -ХМНПФ 30.10.2015 ШадринАВ // ОбработкаЗаполнения() // №24
		// +ХМНПФ 30.05.2017 Кучеров // Заполним суммы при заполнении заявления на основании договора
		Если ЗначениеЗаполнено(ДоговорОПС) Тогда
			 РассчитатьОстатокСумм();
		КонецЕсли;	
		// -ХМНПФ 30.05.2017 Кучеров // Заполним суммы при заполнении заявления на основании договора
	КонецЕсли;
КонецПроцедуры

// +ХМНПФ 30.05.2017 Кучеров // Новая РассчитатьОстатокСумм()
Процедура РассчитатьОстатокСумм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	уп_РезервыОПСОстатки.ТипСуммы,
	|	уп_РезервыОПСОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.уп_РезервыОПС.Остатки(
	|			&ДатаДок,
	|			ДоговорОПС = &ДоговорОПС
	|				И ТипРезерва = &Накопительный) КАК уп_РезервыОПСОстатки";
	
	Запрос.УстановитьПараметр("ДатаДок", Дата);
	Запрос.УстановитьПараметр("ДоговорОПС", ДоговорОПС);
	Запрос.УстановитьПараметр("Накопительный", Перечисления.уп_ТипыРезервовОПС.РезервПенсионныйНакоплений);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	СуммаОбщая = 0;
	СуммаДопВзносов = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ВзносыФиз или Выборка.ТипСуммы = Справочники.уп_ТипыСуммОПС.ИДФиз Тогда
		Иначе
			СуммаДопВзносов = СуммаДопВзносов+Выборка.СуммаОстаток;
		КонецЕсли;	
		СуммаОбщая = СуммаОбщая+Выборка.СуммаОстаток;
	КонецЦикла;
	ОстатокНаСчете = СуммаОбщая;
	ОстатокДопФинансирование = СуммаДопВзносов;
	
КонецПроцедуры	

//Процедура РасшОбщ_ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
Процедура ХМ_ЗАГРУЗКА_ОбработкаПроведения(Отказ, Режим, СтрокаТЗ = Неопределено, СтруктураТЧ = Неопределено) Экспорт
	Если НЕ ПРОВЕДЕН Тогда
		#Если Сервер Тогда
			ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
		#КонецЕсли
		Возврат;	
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерЛицевогоСчета) Тогда
		Движение = Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ДоговорОПС = ДоговорОПС;
		Движение.ЗастрахованноеЛицо = ЗастрахованноеЛицо;
		Движение.ФормаВыплаты = ФормаВыплаты;
		Движение.Банк = Получатель;
		Движение.РасчетныйСчет = РасчетныйСчет;
		Движение.ТипЛицевогоСчета = ТипЛицевогоСчета;
		Движение.НомерЛицевогоСчета = НомерЛицевогоСчета;
	КонецЕсли;
	
#Если Сервер Тогда
	ХМ_ЗагрузкаТЗ_Сервер.ЗаписатьОбъект(Движения.уп_ЛицевыеСчетаЗастрахованныхЛиц);
#КонецЕсли
КонецПроцедуры

// +ХМНПФ 28.0217 Кучеров// Новая Функция ХМ_ПечатьWeb()
// для получения печатных форм со стороны Web сервисов
// аналог процедуры печать типового варианта пользовательского интерфейса
Функция ХМ_ПечатьWeb(ИмяМакета) Экспорт   
	
	ТабДокумент = Новый ТабличныйДокумент; // заглушка на случай если не сформируется ни чего 
	ТабДок=Неопределено;
	Если ИмяМакета = "ЗаявНакоп" Тогда
		Если Пожизненная Тогда
			ТабДокумент = ПечатьПоМакетуСервер(ТабДок,ИмяМакета);
		КонецЕсли;
	ИначеЕсли ИмяМакета = "ЗаявНакоп_ст" Тогда
		Если Пожизненная Тогда
			ТабДокумент = ПечатьПоМакетуСервер(ТабДок,ИмяМакета);
		КонецЕсли;
	ИначеЕсли ИмяМакета = "ЗаявСрочВыплата" Тогда
		Если Срочная Тогда
			ТабДокумент = ПечатьПоМакетуСервер(ТабДок,ИмяМакета);
		КонецЕсли;
	ИначеЕсли ИмяМакета = "ЗаявНакоп_2016Блок1" Тогда
		Если Пожизненная Тогда
			ТабДокумент = ПечатьПоМакетуСервер(ТабДок,"ЗаявНакоп_2016", "Блок1");
		КонецЕсли;
	ИначеЕсли ИмяМакета = "ЗаявНакоп_2016Блок2" Тогда
		Если Пожизненная Тогда
			ТабДокумент = ПечатьПоМакетуСервер(ТабДок,"ЗаявНакоп_2016", "Блок2");
		КонецЕсли;
	КонецЕсли; 
	
	Возврат ТабДокумент; 
	
КонецФункции 

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если ЗначениеЗаполнено(ПринятоеРешение) Тогда
			Если ТипЗнч(ПринятоеРешение)=Тип("ДокументСсылка.уп_РешениеОЕдиновременнойВыплате") Тогда
				ХМ_ТипРешения = Перечисления.ХМ_ТипыРешенияПоЗаявлениюНЧТП.ЕдиновременнаяВыплата;
			ИначеЕсли ТипЗнч(ПринятоеРешение)=Тип("ДокументСсылка.уп_РешениеОбОтказеНЧТП") Тогда
				ХМ_ТипРешения = Перечисления.ХМ_ТипыРешенияПоЗаявлениюНЧТП.ОтказВНазначенииНЧТП;
			ИначеЕсли ТипЗнч(ПринятоеРешение)=Тип("ДокументСсылка.уп_РешениеОНазначенииНЧТП") Тогда
				ХМ_ТипРешения = Перечисления.ХМ_ТипыРешенияПоЗаявлениюНЧТП.НазначенаНЧТП;
			КонецЕсли;
		Иначе
			ХМ_ТипРешения = Перечисления.ХМ_ТипыРешенияПоЗаявлениюНЧТП.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&После("ПриУстановкеНовогоНомера")
Процедура ХМ_ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	ХМ_ПодпискиНаСобытия.ХМ_НомераРешенийПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);		
КонецПроцедуры

//&Вместо("ПечатьПоМакетуСервер")
//Функция РасшОбщ_ПечатьПоМакетуСервер(ТабДок,ИмяМакета, ТипПриложения = "") Экспорт
//		//Пункт1
//		Шапка = ВыбратьДанныеОЗЛСервер();
//		Шапка.Следующий();
//		Если ТабДок=Неопределено Тогда
//			ТабДок = Новый ТабличныйДокумент;
//		Иначе
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//		КонецЕсли;
//		Макет       = ПолучитьМакет(ИмяМакета);
//		ФИО = Строка(Шапка.Фамилия +" "+ Шапка.Имя + " " + Шапка.Отчество);
//		РасшифПодпЗЛ=Строка(Шапка.Фамилия +" "+ Сред(Шапка.Имя,1,1) + "." + Сред(Шапка.Отчество,1,1)+".");
//		ДанныеОтветственного = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, Ответственный.ФизическоеЛицо, Дата);
//		ФИООтветственного = ""+ДанныеОтветственного.Фамилия+" "+Лев(ДанныеОтветственного.Имя,1)+". "+Лев(ДанныеОтветственного.Отчество,1)+".";
//		ДолжностьОтветственного = ДанныеОтветственного.Должность;
//		Если ИмяМакета="ЗаявНакоп" или ИмяМакета="ЗаявНакоп_ст" или ИмяМакета="ЗаявНакоп_2016"
//			 или ИмяМакета="ЗаявНакоп_2019" Тогда
//			ОбластьМакета = Макет.ПолучитьОбласть("Заявление");
//			ОбластьМакета.Параметры.НаимНПФ1 = Шапка.Организация.НаименованиеПолное;
//			ОбластьМакета.Параметры.ФИО_ЗЛ2 = ФИО;
//			ОбластьМакета.Параметры.СНИЛС3 = Шапка.СНИЛС;
//			ОбластьМакета.Параметры.НПСНакопитЧастиТП4 = Шапка.НомерПСНакопительнойЧастиТП;
//			КонтактыЗЛ=ВыбратьКонтактыЗЛСервер();
//			КонтактыЗЛ.Следующий();
//			ЗаполнитьКонтактыЗЛСервер(КонтактыЗЛ,ОбластьМакета);
//			СтрахНомера=ВыбратьСНИЛССервер();
//			СтрахНомера.Следующий();
//			ОбластьМакета.Параметры.СНИЛС3 = СтрахНомера.СНИЛС;
//			ОбластьМакета.Параметры.НПСНакопитЧастиТП4 = СтрахНомера.НомерЛицевогоСчета;
//			Паспорт=ВыбратьПаспортДанныеСервер();
//			Паспорт.Следующий();
//			Граждаство=ОпределитьГражданствоСервер(Паспорт);
//			ДатаВыдачиДУЛ = Паспорт.ДокументДатаВыдачи;
//			МестоРождения=Сред(Паспорт.МестоРождения,3,СтрДлина(Паспорт.МестоРождения));
//			ОбластьМакета.Параметры.ДокументУЛ12 = Паспорт.ДокументВид;
//			ОбластьМакета.Параметры.СерияДУЛ13 = Паспорт.ДокументСерия;
//			ОбластьМакета.Параметры.НомерДУЛ14 = Паспорт.ДокументНомер;
//			ОбластьМакета.Параметры.ДатаВыдачиДУЛ15 = ДатаВыдачиДУЛ;
//			ОбластьМакета.Параметры.КемВыданДУЛ16 = Паспорт.ДокументКемВыдан;
//			Если ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019" Тогда
//				ОбластьМакета.Параметры.СрокДействияДУЛ19 = Паспорт.СрокДействия;
//			КонецЕсли;
//			ОбластьМакета.Параметры.ДатаРожденияЗЛ17 = Паспорт.ДатаРождения;
//			ОбластьМакета.Параметры.МестоРожденияЗЛ18 = ФорматМестоРожденияСервер(МестоРождения);
//			ОбластьМакета.Параметры.Гражданство_ЗЛ5 = Граждаство;
//			ЗаполнитьПолИТрудоустроенностьСервер(ОбластьМакета,Паспорт);
//			//Пункт 2
//			Если ПодаетсяПредставителем Тогда
//				//Заполнение ДППП
//				ОбластьМакета.Параметры.ВидДППП34=НаимДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.СерияДППП30=СерияДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.НомерДППП31=НомерДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.ДатаВыдачиДППП32=ДатаВыдачиДокПодтвПолнПредставителя1;
//				ОбластьМакета.Параметры.КемВыданДППП33=КемВыданДокПодтвПолнПредставителя2; 
//				Если ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019" Тогда
//					ОбластьМакета.Параметры.СрокДействияДППП34=СрокПолномочийПредставителя;
//				КонецЕсли;
//				ВидДоверенногоЛица=ВыбратьВидДоверЛицаСервер();
//				ВидДоверенногоЛица.Следующий();
//				ПредставительЮрФизЛицо=ВидДоверенногоЛица.ПредставительЮрФизЛицо;
//				//Подчеркивание типа представителя
//				СплЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
//				ПодчеркнутьВидПредставительстваСервер(ОбластьМакета,СплЛиния);
//				КонтактыПредставителяЗЛ=ВыбратьКонтактыПредставителяЗЛСервер();
//				КонтактыПредставителяЗЛ.Следующий();
//				
//				РасшПредставителя= Строка(Шапка.ФамилияП+" "+Сред(Шапка.ИмяП,1,1)+ "." +Сред(Шапка.ОтчествоП,1,1)+".");
//				
//				
//				//Заполнение адреса проживания и адреса пребывания представителя
//				ЗаполнитьКонтактыПредставителяСервер(ОбластьМакета,КонтактыПредставителяЗЛ,Шапка);
//				
//				ПаспортПЗЛ=ПолучитьПаспортПЗЛСервер();
//				ПаспортПЗЛ.Следующий();
//				ДатаВыдачиДУЛПЗЛ = ПаспортПЗЛ.ДокументДатаВыдачи;
//				МестоРожденияПЗЛЗаготовка=Сред(ПаспортПЗЛ.МестоРождения,3,СтрДлина(ПаспортПЗЛ.МестоРождения));
//				//Убираем лишние запятые из ПЗЛЗаготовка
//				МестоРожденияПЗЛ=ФорматМестоРожденияСервер(МестоРожденияПЗЛЗаготовка);
//				ОбластьМакета.Параметры.ДокументУЛПЗЛ25 = ПаспортПЗЛ.ДокументВид;
//				ОбластьМакета.Параметры.СерияДУЛПЗЛ26 = ПаспортПЗЛ.ДокументСерия;
//				ОбластьМакета.Параметры.НомерДУЛПЗЛ27 = ПаспортПЗЛ.ДокументНомер;
//				ОбластьМакета.Параметры.ДатаВыдачиДУЛПЗЛ28 = ДатаВыдачиДУЛПЗЛ;
//				ОбластьМакета.Параметры.КемВыданДУЛПЗЛ29 = ПаспортПЗЛ.ДокументКемВыдан;
//			КонецЕсли;
//			//п.3
//			Если ИмяМакета = "ЗаявНакоп_2019" Тогда
//				ЗаполнитьОтметкиП3Сервер(ИмяМакета, ОбластьМакета, WebЦвета.Черный, Истина);
//			Иначе
//				ЗаполнитьОтметкиП3Сервер(ИмяМакета, ОбластьМакета, WebЦвета.Черный);
//			КонецЕсли;	
//			
//			ТабДок.Вывести(ОбластьМакета);
//			//П.7 Заполнение таблицы предоставленных документов
//			ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДок");
//			ЗаполнитьПрилДокументыСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//			ОблОснЧасть2=Макет.ПолучитьОбласть("ОснЧасть2");
//			ОблОснЧасть2.Параметры.ДатаЗаявления = Дата;
//			//Расшифровка подписи ЗЛ
//			Если ПодаетсяПредставителем Тогда
//				ОблОснЧасть2.Параметры.РасшПодпЗЛ = РасшПредставителя;
//			ИначеЕсли Не ПодаетсяПредставителем Тогда
//				ОблОснЧасть2.Параметры.РасшПодпЗЛ = РасшифПодпЗЛ;
//			КонецЕсли;
//			ТабДок.Вывести(ОблОснЧасть2);
//			
//			//Расписка-Уведомление
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//			
//			ОбластьМакетаРУ=Макет.ПолучитьОбласть("Расписка");
//			//Заполнение полей из заявления
//			Если (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019")  И ТипПриложения = "Блок1" Тогда
//				Если ПодаетсяПредставителем Тогда
//					РасшПредставителя= Строка(Шапка.ФамилияП +" "+ Сред(Шапка.ИмяП,1,1) + "." + Сред(Шапка.ОтчествоП,1,1)+".");
//					ОбластьМакетаРУ.Параметры.ПредставительЗЛ19=РасшПредставителя;
//					ОбластьМакетаРУ.Параметры.СпособПодачиЗаявления = "представителем заявителя";
//				Иначе
//					РасшПредставителя="";
//					ОбластьМакетаРУ.Параметры.СпособПодачиЗаявления = "самим заявителем";
//				КонецЕсли;
//				ОбластьМакетаРУ.Параметры.НаимНПФ1=ОбластьМакета.Параметры.НаимНПФ1;
//				ОбластьМакетаРУ.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//				ОбластьМакетаРУ.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//				ОбластьМакетаРУ.Параметры.НПСНакопитЧастиТП4 = СтрахНомера.НомерЛицевогоСчета;
//			ИначеЕсли (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019")  И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//				
//			Иначе
//				Если ПодаетсяПредставителем Тогда
//					РасшПредставителя= Строка(Шапка.ФамилияП +" "+ Сред(Шапка.ИмяП,1,1) + "." + Сред(Шапка.ОтчествоП,1,1)+".");
//					ОбластьМакетаРУ.Параметры.ПредставительЗЛ19=РасшПредставителя;
//				Иначе
//					РасшПредставителя="";
//				КонецЕсли;
//				ОбластьМакетаРУ.Параметры.НаимНПФ1=ОбластьМакета.Параметры.НаимНПФ1;
//				ОбластьМакетаРУ.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//				ОбластьМакетаРУ.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//			КонецЕсли;	
//			ТабДок.Вывести(ОбластьМакетаРУ);
//			
//			Если (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019")  И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//				
//			Иначе
//				ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДокРасписка");
//				ЗаполнитьПрилДокументыСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//			КонецЕсли;	
//			
//			ОблЧасть3=Макет.ПолучитьОбласть("ОснЧасть3");
//			Если (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019") И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//			ИначеЕсли ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019" Тогда
//				ОблЧасть3.Параметры.РегНомерЗаявления=Номер;
//				ОблЧасть3.Параметры.ДатаЗаявления=Дата;
//				ОблЧасть3.Параметры.ДатаРегистрацииЗаявления = ДатаРегистрации;
//			Иначе
//				ОблЧасть3.Параметры.РегНомерЗаявления=Номер;
//				ОблЧасть3.Параметры.ДатаЗаявления=Дата;
//				ОблЧасть3.Параметры.ДопДокНеПозднее=ДопДокНеПозднее;
//				ОблЧасть3.Параметры.РасшРабНПФ=ФИООтветственного;
//			КонецЕсли;
//			ТабДок.Вывести(ОблЧасть3);
//			Если ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019"  И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//			Иначе
//				ЗаполнитьДопДокументыСервер(Макет,ТабДок);
//			КонецЕсли;
//			ОблРУЧасть4 = Макет.ПолучитьОбласть("ОснЧасть4");
//			////Подпись От ЗЛ
//			
//			РасшифПодпЗЛ=Строка(Шапка.Фамилия +" "+ Сред(Шапка.Имя,1,1) + "." + Сред(Шапка.Отчество,1,1)+".");
//			
//			Если ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019" Тогда
//				Если ТипПриложения = "Блок1" Тогда
//					ОблРУЧасть4.Параметры.ДопДокНеПозднее=ДопДокНеПозднее;
//					ОблРУЧасть4.Параметры.ДатаЗаявления=Дата;
//					ОблРУЧасть4.Параметры.РасшРабНПФ=ФИООтветственного;
//				КонецЕсли;
//				ТабДок.Вывести(ОблРУЧасть4);    //первая часть уведомления
//				
//				ОблРУЧасть5 = Макет.ПолучитьОбласть("ОснЧасть5");
//				Если ТипПриложения = "Блок2" Тогда
//					ОблРУЧасть5.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//					ОблРУЧасть5.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//					ОблРУЧасть5.Параметры.НПСНакопитЧастиТП4 = СтрахНомера.НомерЛицевогоСчета;
//					ОблРУЧасть5.Параметры.РегНомерЗаявления=Номер;
//					ОблРУЧасть5.Параметры.ДатаРегистрацииЗаявления=ДатаРегистрации;
//					ОблРУЧасть5.Параметры.РасшРабНПФ=  ОблРУЧасть4.Параметры.РасшРабНПФ;
//					НомДок = 0;
//					Для каждого стр из ДопДокументы Цикл
//						Если стр.Представлен Тогда
//							НомДок = НомДок+1;
//							Если НомДок<=4 Тогда
//								ИмяПараметраНомер = "ДДНом"+Строка(НомДок)+"П";
//								ИмяПараметраНаименование = "ДДНаим"+Строка(НомДок)+"П";
//								ОблРУЧасть5.Параметры[ИмяПараметраНомер] = НомДок;
//								ОблРУЧасть5.Параметры[ИмяПараметраНаименование] = ""+стр.НаименованиеДопДокумента+" "+стр.НаимЧасть2;
//							КонецЕсли;
//						КонецЕсли;	
//					КонецЦикла;
//					ОблРУЧасть5.Параметры.РасшРабНПФ=ФИООтветственного;
//				КонецЕсли;
//				ТабДок.Вывести(ОблРУЧасть5);
//				
//				ОблРУЧасть6 = Макет.ПолучитьОбласть("ОснЧасть6");
//				ОблРУЧасть6.Параметры.РасшРабНПФ =  ФИООтветственного;
//				ОблРУЧасть6.Параметры.РасшПодпЗЛ = РасшифПодпЗЛ;
//				ТабДок.Вывести(ОблРУЧасть6);
//				
//				//второй экземпляр расписки
//				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//				ТабДок.Вывести(ОбластьМакетаРУ);
//				ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДокРасписка");
//				Если (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019")  И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//				Иначе
//					ЗаполнитьПрилДокументыСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//				КонецЕсли;
//				ТабДок.Вывести(ОблЧасть3);
//				Если (ИмяМакета="ЗаявНакоп_2016" или ИмяМакета="ЗаявНакоп_2019")  И ТипПриложения = "Блок2" Тогда   //блок 1 не заполняем
//				Иначе
//					ЗаполнитьДопДокументыСервер(Макет,ТабДок);
//				КонецЕсли;
//				ТабДок.Вывести(ОблРУЧасть4);
//				ТабДок.Вывести(ОблРУЧасть5);
//				ТабДок.Вывести(ОблРУЧасть6);
//			Иначе
//				ОблРУЧасть4.Параметры.РасшПодпЗЛ = ПодписьОтЗЛСервер(РасшифПодпЗЛ, РасшПредставителя);
//				//#Удаление
//				//ОблРУЧасть4.Параметры.ДатаЗаявления = Дата;
//				//#КонецУдаления
//				//#Вставка
//				// +ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьПоМакетуСервер() // №3395
//				//ОблРУЧасть4.Параметры.ДатаЗаявления = Дата;
//				// -ХМНПФ 02.12.2021 МилевскийАЮ // ПечатьПоМакетуСервер // №3395
//				//#КонецВставки
//				ОблРУЧасть4.Параметры.РасшРабНПФ=ФИООтветственного;
//				ОблРУЧасть4.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//				ОблРУЧасть4.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//				ОблРУЧасть4.Параметры.РегНомерЗаявления=Номер;
//				ТабДок.Вывести(ОблРУЧасть4);
//				//второй экземпляр расписки
//				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//				ТабДок.Вывести(ОбластьМакетаРУ);
//				ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДокРасписка");
//				ЗаполнитьПрилДокументыСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//				ТабДок.Вывести(ОблЧасть3);
//				ЗаполнитьДопДокументыСервер(Макет,ТабДок);
//				ТабДок.Вывести(ОблРУЧасть4);
//			КонецЕсли;
//			
//			//Заявление Срочная выплата
//		ИначеЕсли ИмяМакета="ЗаявСрочВыплата" Тогда
//			ОбластьМакета=Макет.ПолучитьОбласть("Часть1");
//			//Заполнение полей из заявления
//			Если ПодаетсяПредставителем Тогда
//				РасшПредставителя= Строка(Шапка.ФамилияП +" "+ Сред(Шапка.ИмяП,1,1) + "." + Сред(Шапка.ОтчествоП,1,1)+".");
//				ОбластьМакета.Параметры.ПредставительЗЛ19=РасшПредставителя;
//			Иначе
//				РасшПредставителя= "";
//				
//			КонецЕсли;
//			
//			//ОблЗаявСрочВыплЧасть1.Параметры.Заполнить(ОбластьМакета.Параметры);
//			
//			ОбластьМакета.Параметры.НаимНПФ1 = Шапка.Организация.НаименованиеПолное;
//			ОбластьМакета.Параметры.ФИО_ЗЛ2 = ФИО;
//			ОбластьМакета.Параметры.СНИЛС3 = Шапка.СНИЛС;
//			ОбластьМакета.Параметры.НПСНакопитЧастиТП4 = Шапка.НомерПСНакопительнойЧастиТП;
//			КонтактыЗЛ=ВыбратьКонтактыЗЛСервер();
//			КонтактыЗЛ.Следующий();
//			ЗаполнитьКонтактыЗЛСервер(КонтактыЗЛ,ОбластьМакета);
//			СтрахНомера=ВыбратьСНИЛССервер();
//			СтрахНомера.Следующий();
//			ОбластьМакета.Параметры.СНИЛС3 = СтрахНомера.СНИЛС;
//			ОбластьМакета.Параметры.НПСНакопитЧастиТП4 = СтрахНомера.НомерЛицевогоСчета;
//			Паспорт=ВыбратьПаспортДанныеСервер();
//			Паспорт.Следующий();
//			Граждаство=ОпределитьГражданствоСервер(Паспорт);
//			ДатаВыдачиДУЛ = Паспорт.ДокументДатаВыдачи;
//			МестоРождения=Сред(Паспорт.МестоРождения,3,СтрДлина(Паспорт.МестоРождения));
//			ОбластьМакета.Параметры.ДокументУЛ12 = Паспорт.ДокументВид;
//			ОбластьМакета.Параметры.СерияДУЛ13 = Паспорт.ДокументСерия;
//			ОбластьМакета.Параметры.НомерДУЛ14 = Паспорт.ДокументНомер;
//			ОбластьМакета.Параметры.ДатаВыдачиДУЛ15 = ДатаВыдачиДУЛ;
//			ОбластьМакета.Параметры.КемВыданДУЛ16 = Паспорт.ДокументКемВыдан;
//			ОбластьМакета.Параметры.ДатаРожденияЗЛ17 = Паспорт.ДатаРождения;
//			ОбластьМакета.Параметры.МестоРожденияЗЛ18 = ФорматМестоРожденияСервер(МестоРождения);
//			ОбластьМакета.Параметры.Гражданство_ЗЛ5 = Граждаство;
//			ЗаполнитьПолИТрудоустроенностьСервер(ОбластьМакета,Паспорт);
//			//Пункт 2
//			Если ПодаетсяПредставителем Тогда
//				//Заполнение ДППП
//				ОбластьМакета.Параметры.ВидДППП34=НаимДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.СерияДППП30=СерияДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.НомерДППП31=НомерДокПодтвПолнПредставителя;
//				ОбластьМакета.Параметры.ДатаВыдачиДППП32=ДатаВыдачиДокПодтвПолнПредставителя1;
//				ОбластьМакета.Параметры.КемВыданДППП33=КемВыданДокПодтвПолнПредставителя2;                
//				ВидДоверенногоЛица=ВыбратьВидДоверЛицаСервер();
//				ВидДоверенногоЛица.Следующий();
//				ПредставительЮрФизЛицо=ВидДоверенногоЛица.ПредставительЮрФизЛицо;
//				//Подчеркивание типа представителя
//				СплЛиния = Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.Сплошная);
//				ПодчеркнутьВидПредставительстваСервер(ОбластьМакета,СплЛиния);
//				КонтактыПредставителяЗЛ=ВыбратьКонтактыПредставителяЗЛСервер();
//				КонтактыПредставителяЗЛ.Следующий();
//				
//				РасшПредставителя= Строка(Шапка.ФамилияП +" "+ Сред(Шапка.ИмяП,1,1) + "." + Сред(Шапка.ОтчествоП,1,1)+".");
//				
//				
//				//Заполнение адреса проживания и адреса пребывания представителя
//				ЗаполнитьКонтактыПредставителяСервер(ОбластьМакета,КонтактыПредставителяЗЛ,Шапка);
//				
//				ПаспортПЗЛ=ПолучитьПаспортПЗЛСервер();
//				ПаспортПЗЛ.Следующий();
//				ДатаВыдачиДУЛПЗЛ = ПаспортПЗЛ.ДокументДатаВыдачи;
//				МестоРожденияПЗЛЗаготовка=Сред(ПаспортПЗЛ.МестоРождения,3,СтрДлина(ПаспортПЗЛ.МестоРождения));
//				//Убираем лишние запятые из ПЗЛЗаготовка
//				МестоРожденияПЗЛ=ФорматМестоРожденияСервер(МестоРожденияПЗЛЗаготовка);
//				ОбластьМакета.Параметры.ДокументУЛПЗЛ25 = ПаспортПЗЛ.ДокументВид;
//				ОбластьМакета.Параметры.СерияДУЛПЗЛ26 = ПаспортПЗЛ.ДокументСерия;
//				ОбластьМакета.Параметры.НомерДУЛПЗЛ27 = ПаспортПЗЛ.ДокументНомер;
//				ОбластьМакета.Параметры.ДатаВыдачиДУЛПЗЛ28 = ДатаВыдачиДУЛПЗЛ;
//				ОбластьМакета.Параметры.КемВыданДУЛПЗЛ29 = ПаспортПЗЛ.ДокументКемВыдан;
//			КонецЕсли;
//			ЗаполнитьПолСервер(ОбластьМакета,Паспорт);
//			ОбластьМакета.Параметры.ТрудПенсияС=ТрудПенсияС;
//			ОбластьМакета.Параметры.СтрахЧастьС=СтрахЧастьС;
//			ОбластьМакета.Параметры.ПериодВыплаты=ПериодВыплаты;
//			ТабДок.Вывести(ОбластьМакета);
//			ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДок");
//			ЗаполнитьПрилДокСрочВыплатаСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//			ОблЗаявСрочВыплЧасть2=Макет.ПолучитьОбласть("Часть2");
//			
//			//ОблЗаявСрочВыплЧасть2.Параметры.Заполнить(ОблОснЧасть2.Параметры);
//			ОблЗаявСрочВыплЧасть2.Параметры.ДатаЗаявления = Дата;
//			//Расшифровка подписи ЗЛ
//			Если ПодаетсяПредставителем Тогда
//				ОблЗаявСрочВыплЧасть2.Параметры.РасшПодпЗЛ = РасшПредставителя;
//			ИначеЕсли Не ПодаетсяПредставителем Тогда
//				ОблЗаявСрочВыплЧасть2.Параметры.РасшПодпЗЛ = РасшифПодпЗЛ;
//			КонецЕсли;
//			
//			ТабДок.Вывести(ОблЗаявСрочВыплЧасть2);
//			
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//			
//			//Расписка-уведомление Сроч Выплата
//			ОбластьМакетаРУ=Макет.ПолучитьОбласть("Титул");
//			//ОблРУСВТитул.Параметры.Заполнить(ОбластьМакета.Параметры);
//			Если ПодаетсяПредставителем Тогда
//				РасшПредставителя= Строка(Шапка.ФамилияП +" "+ Сред(Шапка.ИмяП,1,1) + "." + Сред(Шапка.ОтчествоП,1,1)+".");
//				ОбластьМакетаРУ.Параметры.ПредставительЗЛ19=РасшПредставителя;
//			Иначе
//				РасшПредставителя="";
//			КонецЕсли;
//			
//			ОбластьМакетаРУ.Параметры.НаимНПФ1=ОбластьМакета.Параметры.НаимНПФ1;
//			ОбластьМакетаРУ.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//			ОбластьМакетаРУ.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//			
//			Если ПодаетсяПредставителем Тогда
//				ОбластьМакетаРУ.Параметры.ПредставительЗЛ19=РасшПредставителя;
//			КонецЕсли;
//			ТабДок.Вывести(ОбластьМакетаРУ);
//			
//			ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДок1");
//			ЗаполнитьПрилДокСрочВыплатаСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//			ОблРУСВОснЧасть2=Макет.ПолучитьОбласть("ОснЧасть2");
//			ОблРУСВОснЧасть2.Параметры.РегНомерЗаявления=Номер;
//			ОблРУСВОснЧасть2.Параметры.ДатаЗаявления= Дата;
//			ОблРУСВОснЧасть2.Параметры.ДопДокНеПозднее=ДопДокСВНеПозднее;
//			ОблРУСВОснЧасть2.Параметры.РасшРабНПФ=ФИООтветственного;
//			ТабДок.Вывести(ОблРУСВОснЧасть2);
//			ЗаполнитьДопДокументыСервер(Макет,ТабДок);
//			ОблРУСВОснЧасть3 = Макет.ПолучитьОбласть("ОснЧасть3");
//			////Подпись От ЗЛ
//			РасшифПодпЗЛ=Строка(Шапка.Фамилия +" "+ Сред(Шапка.Имя,1,1) + "." + Сред(Шапка.Отчество,1,1)+".");
//			ОблРУСВОснЧасть3.Параметры.РасшПодпЗЛ = ПодписьОтЗЛСервер(РасшифПодпЗЛ, РасшПредставителя);
//			ОблРУСВОснЧасть3.Параметры.ДатаЗаявления = ОблРУСВОснЧасть2.Параметры.ДатаЗаявления;
//			ОблРУСВОснЧасть3.Параметры.РасшРабНПФ=  ОблРУСВОснЧасть2.Параметры.РасшРабНПФ;
//			ОблРУСВОснЧасть3.Параметры.ФИО_ЗЛ2=ОбластьМакета.Параметры.ФИО_ЗЛ2;
//			ОблРУСВОснЧасть3.Параметры.СНИЛС3=ОбластьМакета.Параметры.СНИЛС3;
//			ОблРУСВОснЧасть3.Параметры.РегНомерЗаявления=Номер;
//			
//			ТабДок.Вывести(ОблРУСВОснЧасть3);
//			
//			// второй экземпляр расписки
//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//			ТабДок.Вывести(ОбластьМакетаРУ);
//			ОбластьСтрокаПрилДок=Макет.ПолучитьОбласть("СтрокаПрилДок1");
//			ЗаполнитьПрилДокСрочВыплатаСервер(Макет,ТабДок,ОбластьСтрокаПрилДок);
//			ТабДок.Вывести(ОблРУСВОснЧасть2);
//			ЗаполнитьДопДокументыСервер(Макет,ТабДок);
//			ТабДок.Вывести(ОблРУСВОснЧасть3);
//		КонецЕсли;
//		ТабДок.АвтоМасштаб = Истина; 
//		Возврат ТабДок
//КонецФункции // ПечатьРаспУведомления

//&Вместо("ЗаполнитьКонтактыЗЛСервер")	
//Процедура РасшОбщ_ЗаполнитьКонтактыЗЛСервер(КонтактыЗЛ,ОбластьМакета)
//	Если  КонтактыЗЛ.ИнфАдр = NULL или КонтактыЗЛ.ИнфАдр = "" Тогда
//		//#Удаление
//		//ОбластьМакета.Параметры.АдрЗЛ_МПр7 = "Нет";
//		//#КонецУдаления
//		//#Вставка
//		// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
//		//ОбластьМакета.Параметры.АдрЗЛ_МПр7 = "Нет";
//		// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
//		//#КонецВставки
//	Иначе
//		ОбластьМакета.Параметры.АдрЗЛ_МПр7 = КонтактыЗЛ.ИнфАдр;
//	КонецЕсли;
//	Если  КонтактыЗЛ.ЮрАдрес = NULL или КонтактыЗЛ.ЮрАдрес = "" Тогда
//		//#Удаление
//		//ОбластьМакета.Параметры.АдрЗЛ_МЖ6 = "Нет";
//		//#КонецУдаления
//		//#Вставка
//		// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
//		//ОбластьМакета.Параметры.АдрЗЛ_МЖ6 = "Нет";
//		// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
//		//#КонецВставки
//	Иначе
//		ОбластьМакета.Параметры.АдрЗЛ_МЖ6 = КонтактыЗЛ.ЮрАдрес;
//	КонецЕсли;
//	Если (КонтактыЗЛ.ФактАдрес<>КонтактыЗЛ.ЮрАдрес И КонтактыЗЛ.ФактАдрес<>КонтактыЗЛ.ИнфАдр) ИЛИ ((КонтактыЗЛ.ЮрАдрес="" или КонтактыЗЛ.ЮрАдрес=NULL) И (КонтактыЗЛ.ИнфАдр="" или КонтактыЗЛ.ИнфАдр=NULL)) Тогда
//		Если  КонтактыЗЛ.ФактАдрес = NULL или КонтактыЗЛ.ФактАдрес = "" Тогда
//			//#Удаление
//			//ОбластьМакета.Параметры.АдрЗЛ_ФактПр8 = "Нет";
//			//#КонецУдаления
//			//#Вставка
//			// +ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер() // №3395
//			//ОбластьМакета.Параметры.АдрЗЛ_ФактПр8 = "Нет";
//			// -ХМНПФ 02.12.2021 МилевскийАЮ // ЗаполнитьКонтактыЗЛСервер // №3395
//			//#КонецВставки
//		Иначе
//			ОбластьМакета.Параметры.АдрЗЛ_ФактПр8 = КонтактыЗЛ.ФактАдрес;
//		Конецесли;
//	КонецЕсли;	
//	//Телефон ЗЛ
//	ОбластьМакета.Параметры.ТелЗЛ9 = КонтактыЗЛ.Тел;
//	//Адреса лиц проживающих за границей
//	Если ПроживаетЗаГраницей Тогда
//		ОбластьМакета.Параметры.АдрЗЛ_МЖДрГос10 = КонтактыЗЛ.ИнострАдрес;
//		ОбластьМакета.Параметры.АдрЗЛ_МЖДоВыезда11 = КонтактыЗЛ.ЮрАдрес;
//	КонецЕсли;
//		
//КонецПроцедуры
